apache/nuttx/arch/arm/src/nrf53/nrf53_usbd.c
static void nrf53_epout_complete(struct nrf53_ep_s *privep);
static void nrf53_ep0out_receive(struct nrf53_usbdev_s *priv);
static void nrf53_epout_receive(struct nrf53_ep_s *privep);
static void nrf53_epout_handle(struct nrf53_usbdev_s *priv,
                                struct nrf53_ep_s *privep);

/* General request handling */

static void nrf53_req_complete(struct nrf53_ep_s *privep, int16_t result);
static void nrf53_req_cancel(struct nrf53_ep_s *privep, int16_t status);
static int nrf53_req_dispatch(struct nrf53_usbdev_s *priv,
                              const struct usb_ctrlreq_s *ctrl);

/* Interrupt handling *******************************************************/

static struct nrf53_ep_s *
nrf53_ep_findbyaddr(struct nrf53_usbdev_s *priv, uint16_t eplog);
static void nrf53_usbreset(struct nrf53_usbdev_s *priv);

/* Other second level interrupt processing */

static void nrf53_resumeinterrupt(struct nrf53_usbdev_s *priv);
static void nrf53_suspendinterrupt(struct nrf53_usbdev_s *priv);
static void nrf53_eventinterrupt(struct nrf53_usbdev_s *priv);
static void nrf53_ep0setupinterrupt(struct nrf53_usbdev_s *priv);
static void nrf53_ep0datainterrupt(struct nrf53_usbdev_s *priv);
static void nrf53_epdatainterrupt(struct nrf53_usbdev_s *priv);
static void nrf53_endepininterrupt(struct nrf53_usbdev_s *priv,
                                   uint32_t irqnow);
static void nrf53_endepoutinterrupt(struct nrf53_usbdev_s *priv,
                                    uint32_t irqnow);

/* First level interrupt processing */

static int nrf53_usbinterrupt(int irq, void *context, void *arg);

/* Endpoint operations ******************************************************/

/* Endpoint configuration */

static int nrf53_epout_configure(struct nrf53_ep_s *privep, uint8_t eptype,
                                 uint16_t maxpacket);
static int nrf53_epin_configure(struct nrf53_ep_s *privep, uint8_t eptype,
                                uint16_t maxpacket);
static int nrf53_ep_configure(struct usbdev_ep_s *ep,
                              const struct usb_epdesc_s *desc, bool last);
static void nrf53_ep0_configure(struct nrf53_usbdev_s *priv);

/* Endpoint disable */

static void nrf53_epout_disable(struct nrf53_ep_s *privep);
static void nrf53_epin_disable(struct nrf53_ep_s *privep);
static int  nrf53_ep_disable(struct usbdev_ep_s *ep);

/* Endpoint request management */

static struct usbdev_req_s *nrf53_ep_allocreq(struct usbdev_ep_s *ep);
static void nrf53_ep_freereq(struct usbdev_ep_s *ep, struct usbdev_req_s *);

/* Endpoint buffer management */

#ifdef CONFIG_USBDEV_DMA
static void *nrf53_ep_allocbuffer(struct usbdev_ep_s *ep, unsigned bytes);
static void nrf53_ep_freebuffer(struct usbdev_ep_s *ep, void *buf);
#endif

/* Endpoint request submission */

static int nrf53_ep_submit(struct usbdev_ep_s *ep, struct usbdev_req_s *req);

/* Endpoint request cancellation */

static int nrf53_ep_cancel(struct usbdev_ep_s *ep, struct usbdev_req_s *req);

/* Stall handling */

static int nrf53_ep_setstall(struct nrf53_ep_s *privep);
static int nrf53_ep_clrstall(struct nrf53_ep_s *privep);
static int nrf53_ep_stall(struct usbdev_ep_s *ep, bool resume);
static void nrf53_ep0_stall(struct nrf53_usbdev_s *priv);

/* Endpoint allocation */

static struct usbdev_ep_s *
nrf53_ep_alloc(struct usbdev_s *dev, uint8_t epno, bool in, uint8_t eptype);
static void nrf53_ep_free(struct usbdev_s *dev, struct usbdev_ep_s *ep);

/* USB device controller operations *****************************************/

static int nrf53_getframe(struct usbdev_s *dev);
static int nrf53_wakeup(struct usbdev_s *dev);
static int nrf53_selfpowered(struct usbdev_s *dev, bool selfpowered);
static int nrf53_pullup(struct usbdev_s *dev, bool enable);
static void nrf53_setaddress(struct nrf53_usbdev_s *priv, uint16_t address);

/* Initialization ***********************************************************/

static void nrf53_swinitialize(struct nrf53_usbdev_s *priv);
static void nrf53_hwinitialize(struct nrf53_usbdev_s *priv);

/****************************************************************************
 * Private Data
 ****************************************************************************/

static struct nrf53_usbdev_s g_usbdev;

/* USB endpoint ops */

static const struct usbdev_epops_s g_epops =
{
  .configure   = nrf53_ep_configure,
  .disable     = nrf53_ep_disable,
  .allocreq    = nrf53_ep_allocreq,
  .freereq     = nrf53_ep_freereq,
#ifdef CONFIG_USBDEV_DMA
  .allocbuffer = nrf53_ep_allocbuffer,
  .freebuffer  = nrf53_ep_freebuffer,
#endif
  .submit      = nrf53_ep_submit,
  .cancel      = nrf53_ep_cancel,
  .stall       = nrf53_ep_stall,
};

/* USB device ops */

static const struct usbdev_ops_s g_devops =
{
  .allocep     = nrf53_ep_alloc,
  .freeep      = nrf53_ep_free,
  .getframe    = nrf53_getframe,
  .wakeup      = nrf53_wakeup,
  .selfpowered = nrf53_selfpowered,
  .pullup      = nrf53_pullup,
};

/****************************************************************************
 * Public Data
 ****************************************************************************/

#ifdef CONFIG_USBDEV_TRACE_STRINGS
const struct trace_msg_t g_usb_trace_strings_deverror[] =
{
  TRACE_STR(NRF53_TRACEERR_ALLOCFAIL),
  TRACE_STR(NRF53_TRACEERR_BADEPNO),
  TRACE_STR(NRF53_TRACEERR_BINDFAILED),
  TRACE_STR(NRF53_TRACEERR_DRIVER),
  TRACE_STR(NRF53_TRACEERR_DRIVERREGISTERED),
  TRACE_STR(NRF53_TRACEERR_INVALIDPARMS),
  TRACE_STR(NRF53_TRACEERR_NOEP),
  TRACE_STR(NRF53_TRACEERR_NOTCONFIGURED),
  TRACE_STR(NRF53_TRACEERR_EPOUTQEMPTY),
  TRACE_STR(NRF53_TRACEERR_EPOUTNULLPACKET),
  TRACE_STR(NRF53_TRACEERR_EP0NOSETUP),
  TRACE_STR(NRF53_TRACEERR_EP0SETUPSTALLED),
  TRACE_STR(NRF53_TRACEERR_DISPATCHSTALL),
  TRACE_STR(NRF53_TRACEERR_BADEPGETSTATUS),
  TRACE_STR(NRF53_TRACEERR_BADEPGETSTATUS),
  TRACE_STR(NRF53_TRACEERR_BADDEVGETSTATUS),
  TRACE_STR(NRF53_TRACEERR_BADCLEARFEATURE),
  TRACE_STR(NRF53_TRACEERR_BADSETFEATURE),
  TRACE_STR(NRF53_TRACEERR_INVALIDCTRLREQ),
  TRACE_STR(NRF53_TRACEERR_BADGETSTATUS),
  TRACE_STR(NRF53_TRACEERR_EPINREQEMPTY),
  TRACE_STR_END
};
#endif

#ifdef CONFIG_USBDEV_TRACE_STRINGS
const struct trace_msg_t g_usb_trace_strings_intdecode[] =
{
  TRACE_STR(NRF53_TRACEINTID_USB),
  TRACE_STR(NRF53_TRACEINTID_INTPENDING),

  TRACE_STR(NRF53_TRACEINTID_DEVRESET),
  TRACE_STR(NRF53_TRACEINTID_STARTED),
  TRACE_STR(NRF53_TRACEINTID_ENDEPIN),
  TRACE_STR(NRF53_TRACEINTID_ENDISOIN),
  TRACE_STR(NRF53_TRACEINTID_ENDEPOUT),
  TRACE_STR(NRF53_TRACEINTID_ENDISOOUT),
  TRACE_STR(NRF53_TRACEINTID_SOF),
  TRACE_STR(NRF53_TRACEINTID_USBEVENT),
  TRACE_STR(NRF53_TRACEINTID_EP0SETUP),
  TRACE_STR(NRF53_TRACEINTID_EP0DATADONE),
  TRACE_STR(NRF53_TRACEINTID_EPDATA),

  TRACE_STR(NRF53_TRACEINTID_ISOOUTCRC),
  TRACE_STR(NRF53_TRACEINTID_SUSPEND),
  TRACE_STR(NRF53_TRACEINTID_RESUME),
  TRACE_STR(NRF53_TRACEINTID_USBWUALLOWED),
  TRACE_STR(NRF53_TRACEINTID_READY),

  TRACE_STR(NRF53_TRACEINTID_DISPATCH),
  TRACE_STR(NRF53_TRACEINTID_GETSTATUS),
  TRACE_STR(NRF53_TRACEINTID_DEVGETSTATUS),
  TRACE_STR(NRF53_TRACEINTID_IFGETSTATUS),
  TRACE_STR(NRF53_TRACEINTID_CLEARFEATURE),
  TRACE_STR(NRF53_TRACEINTID_SETFEATURE),
  TRACE_STR(NRF53_TRACEINTID_SETADDRESS),
  TRACE_STR(NRF53_TRACEINTID_GETSETDESC),
  TRACE_STR(NRF53_TRACEINTID_GETSETIFCONFIG),
  TRACE_STR(NRF53_TRACEINTID_SYNCHFRAME),
  TRACE_STR(NRF53_TRACEINTID_EPGETSTATUS),
  TRACE_STR(NRF53_TRACEINTID_TESTMODE),

