apache/nuttx/arch/arm/src/nrf53/nrf53_usbd.c
    case USB_REQ_SETADDRESS:
      {
        /* type:  host-to-device; recipient = device
         * value: device address
         * index: 0
         * len:   0; data = none
         */

        usbtrace(TRACE_INTDECODE(NRF53_TRACEINTID_SETADDRESS),
                  ctrlreq->value);
        nrf53_setaddress(priv, (uint16_t)priv->ctrlreq.value[0]);

        /* NOTE: The USBD peripheral handles the SetAddress
         * transfer by itself.
         *
         * REVISTI: Documentation states that we shall not handle this
         *          command in the software at all, but if we don't
         *          send EP0STATUS response then enumeration fails.
         */

        break;
      }

    case USB_REQ_GETDESCRIPTOR:
      /* type:  device-to-host; recipient = device
       * value: descriptor type and index
       * index: 0 or language ID;
       * len:   descriptor len; data = descriptor
       */

    case USB_REQ_SETDESCRIPTOR:
      /* type:  host-to-device; recipient = device
       * value: descriptor type and index
       * index: 0 or language ID;
       * len:   descriptor len; data = descriptor
       */

      {
        usbtrace(TRACE_INTDECODE(NRF53_TRACEINTID_GETSETDESC),
                 priv->ctrlreq.req);
        nrf53_req_dispatch(priv, &priv->ctrlreq);
        break;
      }

    case USB_REQ_GETCONFIGURATION:
      /* type:  device-to-host; recipient = device
       * value: 0;
       * index: 0;
       * len:   1; data = configuration value
       */

    case USB_REQ_SETCONFIGURATION:
      /* type:  host-to-device; recipient = device
       * value: configuration value
       * index: 0;
       * len:   0; data = none
       */

    case USB_REQ_GETINTERFACE:
      /* type:  device-to-host; recipient = interface
       * value: 0
       * index: interface;
       * len:   1; data = alt interface
       */

    case USB_REQ_SETINTERFACE:
      /* type:  host-to-device; recipient = interface
       * value: alternate setting
       * index: interface;
       * len:   0; data = none
       */

      {
        usbtrace(TRACE_INTDECODE(NRF53_TRACEINTID_GETSETIFCONFIG),
                 priv->ctrlreq.req);
        nrf53_req_dispatch(priv, &priv->ctrlreq);
        break;
      }

    case USB_REQ_SYNCHFRAME:
      /* type:  device-to-host; recipient = endpoint
       * value: 0
       * index: endpoint;
       * len:   2; data = frame number
       */

      {
        usbtrace(TRACE_INTDECODE(NRF53_TRACEINTID_SYNCHFRAME), 0);
        break;
      }

    default:
      {
        usbtrace(TRACE_DEVERROR(NRF53_TRACEERR_INVALIDCTRLREQ), 0);
        priv->stalled = true;
      }
      break;
    }
}

/****************************************************************************
 * Name: nrf53_ep0setup
 *
 * Description:
 *   USB Ctrl EP Setup Event
 *
 ****************************************************************************/

static void nrf53_ep0setup(struct nrf53_usbdev_s *priv)
{
  struct nrf53_ctrlreq_s ctrlreq;

  /* Terminate any pending requests */

  nrf53_req_cancel(&priv->epout[EP0], -EPROTO);
  nrf53_req_cancel(&priv->epin[EP0],  -EPROTO);

  /* Assume NOT stalled */

  priv->epout[EP0].stalled = false;
  priv->epin[EP0].stalled  = false;
  priv->stalled            = false;

  /* Get ctrlreq */

  ctrlreq.type  = priv->ctrlreq.type;
  ctrlreq.req   = priv->ctrlreq.req;
  ctrlreq.value = GETUINT16(priv->ctrlreq.value);
  ctrlreq.index = GETUINT16(priv->ctrlreq.index);
  ctrlreq.len   = GETUINT16(priv->ctrlreq.len);

  uinfo("type=%02x req=%02x value=%04x index=%04x len=%04x\n",
        ctrlreq.type, ctrlreq.req, ctrlreq.value,
        ctrlreq.index, ctrlreq.len);

  /* Check for a standard request */

  if ((ctrlreq.type & USB_REQ_TYPE_MASK) != USB_REQ_TYPE_STANDARD)
    {
      /* Dispatch any non-standard requests */

      nrf53_req_dispatch(priv, &priv->ctrlreq);
    }
  else
    {
      /* Handle standard requests. */

      nrf53_ep0out_stdrequest(priv, &ctrlreq);
    }

  /* Check if the setup processing resulted in a STALL */

  if (priv->stalled)
    {
      usbtrace(TRACE_DEVERROR(NRF53_TRACEERR_EP0SETUPSTALLED), 0);
      nrf53_ep0_stall(priv);
    }
}

/****************************************************************************
 * Name: nrf53_epin_transfer
 *
 * Description:
 *   Start the Tx data transfer
 *
 ****************************************************************************/

static void nrf53_epin_transfer(struct nrf53_ep_s *privep, uint8_t *buf,
                                int nbytes)
{
  struct nrf53_usbdev_s *priv = NULL;

  /* Sanity Checking */

  DEBUGASSERT(privep && privep->dev);
  priv = (struct nrf53_usbdev_s *)privep->dev;

  /* ISOC not supported yet */

  DEBUGASSERT(privep->eptype != USB_EP_ATTR_XFER_ISOC);
  DEBUGASSERT(nbytes <= 64);

  /* Configure EasyDMA */

  if (buf)
    {
      DEBUGASSERT(nrf53_easydma_valid((uint32_t)buf));
    }

  nrf53_putreg((uint32_t)buf, NRF53_USBD_EPIN_PTR(privep->epphy));
  nrf53_putreg(nbytes, NRF53_USBD_EPIN_MAXCNT(privep->epphy));

  /* Start EPIN task - DMA transfer */

  nrf53_epin_start(priv, privep->epphy);

  /* Busy wait for ENDEPIN to prevent any access to USBD registers during
   * EasyDMA transfer. Otherwise USBD is not stable.
   */

  while (nrf53_getreg(NRF53_USBD_EVENTS_ENDEPIN(privep->epphy)) == 0 &&
         nrf53_getreg(NRF53_USBD_EVENTS_USBRESET) == 0);

  /* For data endpoints the EasyDMA transfer into the endpoint buffer is now
   * complete (busy-wait above), so errata 199 no longer applies. Clear the
   * ENDEPIN event and release the DMA lock right away so that transfers on
   * other endpoints can start without waiting for a separate ENDEPIN
   * interrupt round-trip. Re-arming of this endpoint is prevented
   * separately by priv->epinflight until the host reads the packet. EP0 is
   * left to the normal interrupt flow (its control state machine depends on
   * the ENDEPIN interrupt).
   */

  if (privep->epphy != EP0)
    {
      nrf53_putreg(0, NRF53_USBD_EVENTS_ENDEPIN(privep->epphy));
      nrf53_startdma_ack(priv);
    }
}

/****************************************************************************
 * Name: nrf53_epout_allow
 *
 * Description:
 *   Allow OUT traffic on this endpoint
 *
 ****************************************************************************/

static void nrf53_epout_allow(struct nrf53_ep_s *privep)
{
  /* Write to any value to accept further OUT traffic on this endpoint */

  nrf53_putreg(0, NRF53_USBD_SIZE_EPOUT(privep->epphy));
}

/****************************************************************************
 * Name: nrf53_epout_transfer
 *
 * Description:
 *   Start the Rx data transfer
 *
 ****************************************************************************/

static void nrf53_epout_transfer(struct nrf53_ep_s *privep)
{
  struct nrf53_usbdev_s *priv   = NULL;
  int                    nbytes = 0;

  /* Sanity Checking */

  DEBUGASSERT(privep && privep->dev);
  priv = (struct nrf53_usbdev_s *)privep->dev;

  if (privep->epphy == 0)
    {
      nbytes = USBDEV_EP0_MAXSIZE;
    }
  else
    {
      /* Number of bytes received last in the data stage of this OUT
       * endpoint
       */

      nbytes = nrf53_getreg(NRF53_USBD_SIZE_EPOUT(privep->epphy));
    }

  /* Configure EasyDMA */

  DEBUGASSERT(nrf53_easydma_valid((uint32_t)privep->rxbuff));
  nrf53_putreg((uint32_t)privep->rxbuff,
               NRF53_USBD_EPOUT_PTR(privep->epphy));
  nrf53_putreg(nbytes, NRF53_USBD_EPOUT_MAXCNT(privep->epphy));

