apache/nuttx/arch/arm/src/nrf53/nrf53_usbd.c
  /* Is this an IN or an OUT endpoint? */

  if (USB_ISEPIN(eplog))
    {
      privep = &priv->epin[epphy];
    }
  else
    {
      privep = &priv->epout[epphy];
    }

  /* Return endpoint reference */

  DEBUGASSERT(privep->epphy == epphy);
  return privep;
}

/****************************************************************************
 * Name: nrf53_usbreset
 *
 * Description:
 *   Reset Usb engine
 *
 ****************************************************************************/

static void nrf53_usbreset(struct nrf53_usbdev_s *priv)
{
  struct nrf53_ep_s *privep = NULL;
  uint32_t           regval = 0;
  int                i      = 0;

  uinfo("nrf53_usbreset\n");

  /* Tell the class driver that we are disconnected. The class
   * driver should then accept any new configurations.
   */

  if (priv->driver)
    {
      CLASS_DISCONNECT(priv->driver, &priv->usbdev);
    }

  /* Mark all endpoints as available */

  priv->epavail[0] = NRF53_EP_AVAILABLE;
  priv->epavail[1] = NRF53_EP_AVAILABLE;

  /* Reset DMA and endpoint in-flight state */

  priv->dmanow      = false;
  priv->dmaepinwait = 0;
  priv->dmaepoutwait = 0;
  priv->epinflight  = 0;

  /* Disable all end points */

  for (i = 0; i < NRF53_NENDPOINTS ; i++)
    {
      /* Return write requests to the class implementation */

      privep = &priv->epin[i];
      nrf53_req_cancel(privep, -ESHUTDOWN);

      /* Reset IN endpoint status */

      privep->stalled = false;

      /* Stop EPIN task */

      nrf53_epin_stop(priv, i);

      /* Return read requests to the class implementation */

      privep = &priv->epout[i];
      nrf53_req_cancel(privep, -ESHUTDOWN);

      /* Reset endpoint status */

      privep->stalled = false;

      /* Stop EPOUT task */

      nrf53_epout_stop(priv, i);
    }

  /* Enable the interrupts */

  regval = NRF53_INT_DEFAULT;
  nrf53_putreg(regval, NRF53_USBD_INTEN);

  /* Reset device address to 0 */

  nrf53_setaddress(priv, 0);
  priv->usbdev.speed = USB_SPEED_FULL;

  /* Re-configure EP0 */

  nrf53_ep0_configure(priv);
}

/****************************************************************************
 * Name: nrf53_resumeinterrupt
 *
 * Description:
 *   Resume/remote wakeup detected interrupt
 *
 ****************************************************************************/

static void nrf53_resumeinterrupt(struct nrf53_usbdev_s *priv)
{
#ifdef CONFIG_USBDEV_LOWPOWER
  /* Force normal state */

  nrf53_putreg(0, NRF53_USBD_LOWPOWER);

  /* TODO: wait for event */
#endif

  /* Restore full power -- whatever that means for this particular board */

  nrf53_usbsuspend((struct usbdev_s *)priv, true);

  /* Notify the class driver of the resume event */

  if (priv->driver)
    {
      CLASS_RESUME(priv->driver, &priv->usbdev);
    }
}

/****************************************************************************
 * Name: nrf53_suspendinterrupt
 *
 * Description:
 *   USB suspend interrupt
 *
 ****************************************************************************/

static void nrf53_suspendinterrupt(struct nrf53_usbdev_s *priv)
{
  /* Notify the class driver of the suspend event */

  if (priv->driver)
    {
      CLASS_SUSPEND(priv->driver, &priv->usbdev);
    }

#ifdef CONFIG_USBDEV_LOWPOWER
  /* Force low power state */

  nrf53_putreg(1, NRF53_USBD_LOWPOWER);
#endif

  /* Let the board-specific logic know that we have entered the suspend
   * state
   */

  nrf53_usbsuspend((struct usbdev_s *)priv, false);
}

/****************************************************************************
 * Name: nrf53_eventinterrupt
 *
 * Description:
 *   Handle EVENT events
 *
 ****************************************************************************/

static void nrf53_eventinterrupt(struct nrf53_usbdev_s *priv)
{
  uint32_t regval = 0;
  uint32_t clr    = 0;

  regval = nrf53_getreg(NRF53_USBD_EVENTCAUSE);

  if (regval & USBD_EVENTCAUSE_ISOOUTCRC)
    {
      usbtrace(TRACE_INTDECODE(NRF53_TRACEINTID_ISOOUTCRC), 0);
      clr |= USBD_EVENTCAUSE_ISOOUTCRC;
    }

  if (regval & USBD_EVENTCAUSE_SUSPEND)
    {
      usbtrace(TRACE_INTDECODE(NRF53_TRACEINTID_SUSPEND), 0);
      nrf53_suspendinterrupt(priv);
      clr |= USBD_EVENTCAUSE_SUSPEND;
    }

  if (regval & USBD_EVENTCAUSE_RESUME)
    {
      usbtrace(TRACE_INTDECODE(NRF53_TRACEINTID_RESUME), 0);
      nrf53_resumeinterrupt(priv);
      clr |= USBD_EVENTCAUSE_RESUME;
    }

  if (regval & USBD_EVENTCAUSE_USBWUALLOWED)
    {
      usbtrace(TRACE_INTDECODE(NRF53_TRACEINTID_USBWUALLOWED), 0);
      clr |= USBD_EVENTCAUSE_USBWUALLOWED;
    }

  if (regval & USBD_EVENTCAUSE_READY)
    {
      usbtrace(TRACE_INTDECODE(NRF53_TRACEINTID_READY), 0);
      clr |= USBD_EVENTCAUSE_READY;
    }

  /* Clear all pending events */

  nrf53_putreg(clr, NRF53_USBD_EVENTCAUSE);
}

/****************************************************************************
 * Name: nrf53_ep0setupinterrupt
 *
 * Description:
 *   Handle EP0SETUP event
 *
 ****************************************************************************/

static void nrf53_ep0setupinterrupt(struct nrf53_usbdev_s *priv)
{
  /* Get SETUP data */

  priv->ctrlreq.type     = nrf53_getreg(NRF53_USBD_BMREQUESTTYPE);
  priv->ctrlreq.req      = nrf53_getreg(NRF53_USBD_BREQUEST);
  priv->ctrlreq.value[0] = nrf53_getreg(NRF53_USBD_WVALUEL);
  priv->ctrlreq.value[1] = nrf53_getreg(NRF53_USBD_WVALUEH);
  priv->ctrlreq.index[0] = nrf53_getreg(NRF53_USBD_WINDEXL);
  priv->ctrlreq.index[1] = nrf53_getreg(NRF53_USBD_WINDEXH);
  priv->ctrlreq.len[0]   = nrf53_getreg(NRF53_USBD_WLENGTHL);
  priv->ctrlreq.len[1]   = nrf53_getreg(NRF53_USBD_WLENGTHH);

  /* Store request len */

  priv->ep0reqlen = GETUINT16(priv->ctrlreq.len);

  if (USB_REQ_ISOUT(priv->ctrlreq.type))
    {
      priv->ep0datlen = 0;

      if (priv->ep0reqlen == 0)
        {
          nrf53_ep0setup(priv);
        }
      else
        {
          /* Allows OUT data stage on control endpoint 0 */

          nrf53_ep0rcvout_start(priv);
        }
    }
  else
    {
      /* Start the setup */

      nrf53_ep0setup(priv);
    }

  /* Handle zero length packets for IN and OUT */

  if (priv->ep0reqlen == 0)
    {
      /* Allows status stage on control endpoint 0 */

      nrf53_ep0status_start(priv);
    }
}

/****************************************************************************
 * Name: nrf53_ep0datainterrupt
 *
 * Description:
 *   Handle EP0DATADONE event
 *
 ****************************************************************************/

static void nrf53_ep0datainterrupt(struct nrf53_usbdev_s *priv)
{
  struct nrf53_ep_s *privep = NULL;

